run/cases/KattingerValidation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          	GAMG;
        preconditioner  	GAMG;
        tolerance       	1e-08;
        relTol          	0.01;
	smoother		DICGaussSeidel;
	cacheAgglomeration	true;
	nCellsInCoarsestLevel	145;
	agglomerator		faceAreaPair;
	mergeLevels		1;
	directSolveCoarsest	false;
    }

    U
    {
        solver          smoothSolver;
	smoother	GaussSeidel;
        nSweeps		1;
        tolerance       1e-06;
        relTol          0.01;
    }

    "(e|h)"
    {
        solver          smoothSolver;
	smoother	GaussSeidel;
        nSweeps		2;
        tolerance       1e-09;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;			//0	Anzahl der zusätzlichen Durchläufe der while Schleife in Druckiteration
    pMinFactor      0.99;			//0.99	pMin auf das Solver limitiert wird, bezogen auf atmösphärischen Druck
    pMaxFactor      200;			//200	pMax auf das Solver limitiert wird, bezogen auf atmösphärischen Druck
    transonic       no;				//no	ob wir schallnahe bzw. Überschallgeschwindigkeiten haben --> nein
    consistent      yes;			//yes	wenn yes: Verwendung des SIMPLEC Algorithmus anstelle des SIMPLE --> SIMPLEC = pressure under relaxation = 1
    rhoMax          rhoMax [ 1 -3 0 0 0 0 0 ] 1.2;
    rhoMin          rhoMin [ 1 -3 0 0 0 0 0 ] 0.9;

    residualControl
    {
        p               1e-8;		//1e-9
        U               1e-6;		//1e-4
        e               1e-9;		//1e-9
    }
}

relaxationFactors //Werte kleiner 1 machen das Ganze weniger konvergent aber dafür stabiler
{
    U               0.8;
    p               0.9;
    rho             0.01;
    e               0.9;
}

// ************************************************************************* //
